{
    "fullStack": {
        "title": "React, Javascript, Ruby on Rails",
        "description": "The following projects are web apps with Javascript, React and/or Ruby. Each front-end of the projects focuses on utilizing different skill sets. Back-ends are built with JWT, REST API, SQL and/or ActiveRecord.  ",
        "lists": [{
            "title": "Trivia Web Application",
            "skills": "React, Jest, unit test/component test, Sass",
            "description": "A trivia web application built for Tandem code challenge. The user can answer through set of 10 questions which are randomly selected from a JSON file. User can click through answer choices are having access to current score. Review of previous and new round button are offered on completing 10 questions.",
            "skillsDescription": "This app practices front-end skills with React. It includes React tests for each component and container. This app parses through provided JSON file. Since this is a simple app, state management was done through useState.",
            "image": {"src": "TT", "alt": "Start page of a trivia web app"},

            "link": "https://github.com/liahnee/tandem-trivia",
            "type": "github"
        },{
            "title": "Web Health Record",
            "skills": "React, Redux, JWT, Semantic UI, Ruby on Rails, ActiveRecord, REST API, PostgreSQL, Trello(Kanban-style), MVC model",
            "description": "This project was built to mock a patient chart used in the primary care clinics. Users can create multiple patient profiles, their chief complaints, and visit chart for each complaint.",
            "skillsDescription": "The skill sets exercised with this project was implementing JWT and Redux for the React front-end and Ruby on Rails backend. Redux was used for the scalability of the app. Data massaging was also done for diagnosis which searches on ICD11 API.",
            "image": {"src": "WHR", "alt":"WHR page preview"},
            "link": "https://github.com/liahnee/whr_frontend",
            "type": "github"
        },{
            "title": "Sentimental Tweet",
            "skills": "React, Semantic UI, Ruby on Rails, ActiveRecord, REST API, SQL, GitHub, Communication, Teamwork, MVC",
            "description": "This app calls on Tweeter API and runs sentiment API on their most recent tweets. Users can log in to create favorites and observe trends on their Tweet sentiment.",
            "skillsDescription": "This was a team project where I took a lead on the front-end. Using React and Semantic UI, I designed a thoughtful and seamless UI/UX designs.",
            "image": {"src": "ST", "alt":"Sentimental Tweet page preview"},
            "link": "https://github.com/liahnee/sentimentTweet",
            "type": "github"
        },{
            "title": "Grow a Tree",
            "skills": "Javascript, CSS3, Ruby on Rails, ActiveRecord, REST API, SQL, GitHub, MVC",
            "description": "Users can select a random seed and watch it grow into different a tree as it is watered.",
            "skillsDescription": "The focus of the project was using vanilla CSS and vanilla JS with RESTFUL API and respond accordingly with different data sent from the backend.",
            "image": {"src": "Tree", "alt":"Grow a Tree page preview"},
            "link": "https://github.com/liahnee/tree",
            "type": "github"
        },{
            "title": "Adopt a Child",
            "skills": "Ruby, ERB, CSS3, Ruby on Rails, ActiveRecord, REST API, SQL, MVC",
            "description": "This is a game app where a user can adopt a child of random stats and gender. Users can create a schedule for the child and how each schedule affected the child's status to figure out their characteristics.",
            "skillsDescription": "This project was entirely Ruby on Rails for the front and the back-end. This project has many backend calculations and conditions for a different set of characteristics the data holds for rendering and carrying out new calculations. Vanilla CSS was used for UI.",
            "image": {"src": "AC", "alt":"Adopt a Child page preview"},
            "link": "https://github.com/liahnee/child_rails_mod2",
            "type": "github"
        },{
            "title": "Schedule an Exam",
            "skills": "CFML, Coldbox, MySQL, MVC",
            "description": "Scheduler can select and exam, which will dynamically fetch the available dates and testing centers for the selected option. Receipt number is auto generated and scheduler is redirected to a confirmation page with saved data on submit.",
            "skillsDescription": "Coldfusion markup language, CFML, was a new language for me to try writing an app with. By using coldbox framework, I was able to create a backend with MVC model.",
            "image": {"src": "SE", "alt":"Schedule an Exam page preview"},
            "link": "https://github.com/liahnee/ntn-takehome",
            "type": "github"
        }]
    },
    "frontEnd":{
        "title": "HTML5/CSS3",
        "description": "The following projects are practice designs written only with HTML5 and CSS3. The projects focus on enhancing accessibility and utilizing different elements of HTML. Clicking on the project image links to the corresponding CodePen page.",
        "lists": [{
            "title": "Style: Portfolio/Product Landing Page",
            "skills": "HTML5, CSS3",
            "description": "This page introduces different video contents created by a musician Song4B.",
            "skillsDescription": "The page utilizes z-index and pseudo-elements to create a layered background. HTML5 elements used include but are not limited to, header, main, nav, section, details, and iframe.",
            "image": {"src": "PPro", "alt": "Product landing page preview"},

            "link": "https://codepen.io/liahnee/full/RwPdevz",
            "type": "codepen"
        },{
            "title": "Style: Documentation Page",
            "skills": "HTML5, CSS3",
            "description": "The page summarizes basic foundation of SASS, referenced by sass-lang.com.",
            "skillsDescription": "The project was to format in a documentation style with focused on accessibility through keeping track of each header in an appropriate order and utilizing the code element.",
            "image": {"src": "PDoc", "alt": "Documentation page preview"},
            "link": "https://codepen.io/liahnee/full/GRJamWB",
            "type": "codepen"
        },{
            "title": "Style: Survey Page",
            "skills": "HTML5, CSS3",
            "description": "This is a survey page to be filled out by a user regarding user experience on the website.",
            "skillsDescription": "The page explores multiple form elements as well as their attributes. Some of the elements included in the page are checkbox, radio, text-area, and dropdown. Clean and minimal images and colors were used to reduce distractions. ",
            "image": {"src":"PSur", "alt":"Survey page preview"},
            "link": "https://codepen.io/liahnee/full/wvaNbZz",
            "type": "codepen"
        },{
            "title": "Style: Tribute Page",
            "skills": "HTML5, CSS3",
            "description": "This project was to create a tribute page for Cardinal Stephen Kim, who is one of the respected figures in modern Korean history.",
            "skillsDescription": "The page handles multiple HTML5 elements, which includes but are not limited to figure, fig-caption, details, section, blockquotes, hr, ul, and cite.",
            "image": {"src":"PTri", "alt":"Tribute page preview"},
            "link": "https://codepen.io/liahnee/full/PoqVRQK",
            "type": "codepen"
        }]
    }
}